In [1]:
import numpy as np
import pandas as pd

# Read and Write CSV Files

In [2]:
df = pd.read_csv('books.csv')

In [3]:
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [8]:
df = pd.read_table('books2.csv', sep=';')

In [9]:
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [18]:
pd.read_csv('books.csv', nrows=2)

        ID                   Title         Author PublicationDate
0  001276A  The Rise of the Falcon   John Admiral     25-Apr-2018
1  023125B         Controlled mind  Robert Greens     28-Aug-2016

In [283]:
df.to_csv('books_saved.csv')

In [5]:
import sys
df.to_csv(sys.stdout)

,ID,Title,Author,PublicationDate
0,001276A,The Rise of the Falcon,John Admiral,25-Apr-2018
1,023125B,Controlled mind,Robert Greens,28-Aug-2016
2,005556E,Only love remains,Greta Blooming,17-Feb-2015

In [6]:
df.to_csv(sys.stdout, index=False, header=False)

001276A,The Rise of the Falcon,John Admiral,25-Apr-2018
023125B,Controlled mind,Robert Greens,28-Aug-2016
005556E,Only love remains,Greta Blooming,17-Feb-2015

In [8]:
df.to_csv(sys.stdout, columns=['Title','Author'],index=False)

Title,Author
The Rise of the Falcon,John Admiral
Controlled mind,Robert Greens
Only love remains,Greta Blooming

In [15]:
df[1:].to_csv(sys.stdout)

,ID,Title,Author,PublicationDate
1,023125B,Controlled mind,Robert Greens,28-Aug-2016
2,005556E,Only love remains,Greta Blooming,17-Feb-2015

# Read and Write Microsoft Excel Files

In [3]:
xlssource = pd.ExcelFile('books.xlsx')
df = pd.read_excel(xlssource, 'Sheet1')
df

          ID                   Title          Author PublicationDate
0    001276A  The Rise of the Falcon    John Admiral      2018-04-25
1   023125B          Controlled mind   Robert Greens      2016-08-28
2    005556E       Only love remains  Greta Blooming      2015-02-17

In [5]:
XLSWriter = pd.ExcelWriter('newbooks.xlsx')

In [6]:
df.to_excel(XLSWriter, 'Sheet1')

In [7]:
XLSWriter.save()

# Read data from HTML pages on the web

In [34]:
url = 'https://en.wikipedia.org/wiki/Rome'
dfs = pd.read_html(url)

In [35]:
len(dfs)

48

In [40]:
dfs = pd.read_html(url, match='Climate data')
len(dfs)

1

In [42]:
dfs[0]

  Climate data for Rome Urbe Airport (altitude: 24 m sl, 7 km north from Colosseum satellite view)  \
                                                                                             Month
0                                Record high °C (°F)
1                               Average high °C (°F)
2                                 Daily mean °C (°F)
3                                Average low °C (°F)
4                                 Record low °C (°F)
5                  Average precipitation mm (inches)
6                Average precipitation days (≥ 1 mm)
7                        Mean monthly sunshine hours
8     Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Jan
0                                      20.2(68.4)
1                                      12.6(54.7)
2                                       7.4(45.3)
3                                       2.1(35.8)
4                                      −9.8(14.4)
5                                      69.5(2.74)
6                                             7.6
7                                           120.9
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Feb
0                                      23.6(74.5)
1                                      14.0(57.2)
2                                       8.4(47.1)
3                                       2.7(36.9)
4                                      −6.0(21.2)
5                                      75.8(2.98)
6                                             7.4
7                                           132.8
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Mar
0                                      27.0(80.6)
1                                      16.5(61.7)
2                                      10.4(50.7)
3                                       4.3(39.7)
4                                      −9.0(15.8)
5                                      59.0(2.32)
6                                             7.8
7                                           167.4
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Apr
0                                      28.3(82.9)
1                                      18.9(66.0)
2                                      12.9(55.2)
3                                       6.8(44.2)
4                                      −2.5(27.5)
5                                      76.2(3.00)
6                                             8.8
7                                           201.0
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              May
0                                      33.1(91.6)
1                                      23.9(75.0)
2                                      17.3(63.1)
3                                      10.8(51.4)
4                                       3.7(38.7)
5                                      49.1(1.93)
6                                             5.6
7                                           263.5
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Jun
0                                      36.8(98.2)
1                                      28.1(82.6)
2                                      21.2(70.2)
3                                      14.3(57.7)
4                                       6.2(43.2)
5                                      40.7(1.60)
6                                             4.1
7                                           285.0
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Jul
0                                     40.0(104.0)
1                                      31.5(88.7)
2                                      24.2(75.6)
3                                      16.9(62.4)
4                                       9.8(49.6)
5                                      21.0(0.83)
6                                             2.3
7                                           331.7
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Aug
0                                     39.6(103.3)
1                                      31.7(89.1)
2                                      24.5(76.1)
3                                      17.3(63.1)
4                                       8.6(47.5)
5                                      34.1(1.34)
6                                             3.2
7                                           297.6
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Sep
0                                      37.6(99.7)
1                                      27.5(81.5)
2                                      20.9(69.6)
3                                      14.3(57.7)
4                                       5.4(41.7)
5                                      71.8(2.83)
6                                             5.6
7                                           237.0
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Oct
0                                      31.4(88.5)
1                                      22.4(72.3)
2                                      16.4(61.5)
3                                      10.5(50.9)
4                                       0.0(32.0)
5                                     107.0(4.21)
6                                             7.7
7                                           195.3
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Nov
0                                      26.0(78.8)
1                                      16.5(61.7)
2                                      11.2(52.2)
3                                       5.8(42.4)
4                                      −7.2(19.0)
5                                     109.9(4.33)
6                                             9.1
7                                           129.0
8  Source: Servizio Meteorologico[79] (1971–2000)

                                                   \
                                              Dec
0                                      22.8(73.0)
1                                      13.2(55.8)
2                                       8.2(46.8)
3                                       3.1(37.6)
4                                      −5.4(22.3)
5                                      84.4(3.32)
6                                             8.5
7                                           111.6
8  Source: Servizio Meteorologico[79] (1971–2000)


                                             Year
0                                     40.0(104.0)
1                                      21.4(70.5)
2                                      15.3(59.5)
3                                       9.1(48.4)
4                                      −9.8(14.4)
5                                    798.5(31.44)
6                                            77.7
7                                            2473
8  Source: Servizio Meteorologico[79] (1971–2000)

In [44]:
df = dfs[0]

In [49]:
df = pd.read_csv('books.csv')
df

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [56]:
df.to_html('books.html')

# Read and write data from XML files

In [25]:
import lxml

In [29]:
df = pd.read_xml('library.xml')
df

,category,title,author,year,country
0,crime,Death on the Nile,Agatha Christie,1937,United Kingdom
1,crime,The Hound of the Baskervilles,Arthur Conan Doyle,1902,United Kingdom
2,psichology,Psychology and Alchemy,Carl Gustav Jung,1944,Germany
3,novel,The Castel,Franz Kafka,1926,Germany

In [30]:
df2 = pd.read_csv('books.csv')
df2.PublicationDate = pd.to_datetime(df2.PublicationDate) 
df2.to_xml('newbooks.xml')

In [31]:
pd.read_xml('newbooks.xml')

   index       ID                   Title          Author      PublicationDate
0      0  001276A  The Rise of the Falcon    John Admiral  2018-04-25 00:00:00
1      1  023125B         Controlled mind   Robert Greens  2016-08-28 00:00:00
2      2  005556E       Only love remains  Greta Blooming  2015-02-17 00:00:00

In [37]:
xml = """<?xml version="1.0" encoding="UTF-8"?>
<library>
  <floor val='1'>
      <book category="crime">
        <title>Death on the Nile</title>
        <author>Agatha Christie</author>
        <year>1937</year>
        <country>United Kingdom</country>
      </book>
      <book category="crime">
        <title>The Hound of the Baskervilles</title>
        <author>Arthur Conan Doyle</author>
        <year>1902</year>
        <country>United Kingdom</country>
      </book>
  </floor>
  <floor val='2'>
      <book category="psichology">
        <title>Psychology and Alchemy</title>
        <author>Carl Gustav Jung</author>
        <year>1944</year>
        <country>Germany</country>
      </book>
      <book category="novel">
        <title>The Castel</title>
        <author>Franz Kafka</author>
        <year>1926</year>
        <country>Germany</country>
      </book>
  </floor>
</library>
"""

In [34]:
pd.read_xml(xml)

   val  book
0    1   NaN
1    2   NaN

In [82]:
xsl = """<xsl:stylesheet version="1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
   <xsl:output method="xml" omit-xml-declaration="no" indent="yes"/>
   <xsl:strip-space elements="*"/>
   <xsl:template match="/library">
      <xsl:copy>
        <xsl:apply-templates select="floor"/>
      </xsl:copy>
   </xsl:template>
   <xsl:template match="floor">
      <xsl:apply-templates select="book"/>   
   </xsl:template>
   <xsl:template match="book">
      <xsl:copy>
         <category><xsl:value-of select="@category"/></category>
         <title><xsl:value-of select="title"/></title>
         <author><xsl:value-of select="author"/></author>
         <year><xsl:value-of select="year"/></year>
         <country><xsl:value-of select="country"/></country>
      </xsl:copy>
   </xsl:template>
 </xsl:stylesheet>
 """

In [83]:
pd.read_xml(xml, stylesheet=xsl)

,category,title,author,year,country
0,crime,Death on the Nile,Agatha Christie,1937,United Kingdom
1,crime,The Hound of the Baskervilles,Arthur Conan Doyle,1902,United Kingdom
2,psichology,Psychology and Alchemy,Carl Gustav Jung,1944,Germany
3,novel,The Castel,Franz Kafka,1926,Germany

# Read and Write data in JSON

In [285]:
df = pd.read_csv('books.csv')
df

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [ ]:
df.to_json('books.json')

In [98]:
import sys
df.to_json(sys.stdout)

{"ID":{"0":"001276A","1":"023125B","2":"005556E"},"Title":{"0":"The Rise of the Falcon","1":"Controlled mind","2":"Only love remains"},"Author":{"0":"John Admiral","1":"Robert Greens","2":"Greta Blooming"},"PublicationDate":{"0":"25-Apr-2018","1":"28-Aug-2016","2":"17-Feb-2015"}}

In [97]:
pd.read_json('books.json')

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [14]:
jsondata = {
"company": "BMW",
"site": "Munchen, Germany",
"production": "Motor Vehicles",
"products": [
{
"product": "Series 1",
"model": " 116d 5-Door Sport Pack"
},
{
"product": "Series 3",
"model": " 330E xDrive Sport Aut"
}
]
}

In [15]:
pd.read_json(jsondata)

ValueError: Invalid file path or buffer object type: <class 'dict'>

In [16]:
pd.json_normalize(jsondata)

,company,site,production,products
0,BMW,"Munchen, Germany",Motor Vehicles,"[{'product': 'Series 1', 'model': ' 116d 5-Doo..."

In [17]:
pd.json_normalize(jsondata, "products", ["company","site","production"])

    product                    model company              site      production
0  Series 1   116d 5-Door Sport Pack     BMW  Munchen, Germany  Motor Vehicles
1  Series 3    330E xDrive Sport Aut     BMW  Munchen, Germany  Motor Vehicles

# Write and read data in binary format

In [110]:
df = pd.read_csv('books.csv')
df

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [111]:
df.to_pickle('newbooks.dat')

In [112]:
pd.read_pickle('newbooks.dat')

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

# Interact with databases for data exchange

In [27]:
import sqlite3

query = """
     CREATE TABLE Fruits
     (fruit VARCHAR(20),
      weight REAL(20),
      amount INTEGER,
      price REAL,
      origin VARCHAR(20)
     );"""

In [28]:
conn = sqlite3.connect('mydata.sqlite')
conn.execute(query)
conn.commit()

In [29]:
data = [('Apples',12.5,6,100.23,'Germany'),
        ('Cherries',4.5,3,200.50,'Turkey'),
        ('Ananas',19.4,4,300.85,'Madagascar'),
        ('Strawberries',7.8,12,250.33,'Italy'),
       ]

stmt = "INSERT INTO Fruits VALUES (?,?,?,?,?)"
conn.executemany(stmt, data)
conn.commit()

In [31]:
cursor = conn.execute('SELECT * FROM Fruits')
rows = cursor.fetchall()
rows

[('Apples', 12.5, 6, 100.23, 'Germany'),
 ('Cherries', 4.5, 3, 200.5, 'Turkey'),
 ('Ananas', 19.4, 4, 300.85, 'Madagascar'),
 ('Strawberries', 7.8, 12, 250.33, 'Italy')]

In [32]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

          fruit  weight  amount   price      origin
0        Apples    12.5       6  100.23     Germany
1      Cherries     4.5       3  200.50      Turkey
2        Ananas    19.4       4  300.85  Madagascar
3  Strawberries     7.8      12  250.33       Italy

# Working with Time Data

In [4]:
pd.Timestamp('2021-11-30')

Timestamp('2021-11-30 00:00:00')

In [5]:
pd.Timestamp('2021-Nov-30')

Timestamp('2021-11-30 00:00:00')

In [6]:
pd.Timestamp('2021/11/30')

Timestamp('2021-11-30 00:00:00')

In [7]:
pd.Timestamp(2021,11,30,0,0,0)

Timestamp('2021-11-30 00:00:00')

In [8]:
pd.Timestamp(2021,11,30)

Timestamp('2021-11-30 00:00:00')

In [66]:
df = pd.DataFrame({'year': [2019, 2020, 2021],
                   'month': [10, 6, 4],
                   'day': [15, 10, 20]})
print(df)

   year  month  day
0  2019     10   15
1  2020      6   10
2  2021      4   20

In [69]:
ts = pd.to_datetime(df)
print(ts)
print(type(ts))

0   2019-10-15
1   2020-06-10
2   2021-04-20
dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

In [79]:
t = pd.to_datetime('2021 USA 31--12', format='%Y USA %d--%m', errors='raise')
print(t)

2021-12-31 00:00:00

In [85]:
ts = pd.Series(['2019 USA 31--12','2020 ITA 20--11','2021 USA 10--10'])
print(ts)

0    2019 USA 31--12
1    2020 ITA 20--11
2    2021 USA 10--10
dtype: object

In [89]:
t = pd.to_datetime(ts, format='%Y USA %d--%m', errors='ignore')
print(t)

0    2019 USA 31--12
1    2020 ITA 20--11
2    2021 USA 10--10
dtype: object

In [59]:
pd.Timestamp('2021-Nov-30 11:40', tz='UTC')

Timestamp('2021-11-30 11:40:00+0000', tz='UTC')

In [48]:
pd.Timestamp('2021-Nov-30 11:40', tz='Europe/Stockholm')

Timestamp('2021-11-30 11:40:00+0100', tz='Europe/Stockholm')

In [61]:
t = pd.Timestamp('2021-Nov-30 11:40PM')
print(t)
t = t.tz_localize(tz='America/Sao_Paulo')
print(t)

2021-11-30 23:40:00
2021-11-30 23:40:00-03:00

In [62]:
t2 = t.tz_convert('US/Eastern')
print(t2)

2021-11-30 21:40:00-05:00

In [63]:
print(t.year)
print(t.month)
print(t.day)
print(t.hour)
print(t.minute)
print(t.second)
print(t.tz)

2021
11
30
23
40
0
America/Sao_Paulo

In [64]:
t.hour = 12

AttributeError: attribute 'hour' of 'datetime.datetime' objects is not writable

In [90]:
pd.Timedelta('1 Day')

Timedelta('1 days 00:00:00')

In [92]:
t = pd.Timestamp('2021-Nov-16 10:30AM')
print(t)
dt = pd.Timedelta('1 Hour')
t = t + dt
print(t)

2021-11-16 10:30:00
2021-11-16 11:30:00

In [93]:
t = pd.Timestamp('2021-Nov-16 10:30AM')
t = t + pd.Timedelta('1 Hour')
print(t)

2021-11-16 11:30:00

In [96]:
pd.Timedelta(1, unit="d")

Timedelta('1 days 00:00:00')

In [110]:
pd.Timedelta(150045, unit="s")

Timedelta('1 days 17:40:45')

In [107]:

Timedelta('3 days 05:34:23')pd.Timedelta('3D 5:34:23')

Timedelta('3 days 05:34:23')

In [99]:
t1 = pd.Timestamp('2021-Jan-01 11:30AM')
t2 = pd.Timestamp('2021-Mar-13 4:15PM')
dt = t2 - t1
print(dt)
print(type(dt))

71 days 04:45:00
<class 'pandas._libs.tslibs.timedeltas.Timedelta'>

In [114]:
ts = pd.Series(['00:22:33','00:13:12','00:24:14'])
print(ts)
dt = pd.to_timedelta(ts, errors='raise')
print(dt)

0    00:22:33
1    00:13:12
2    00:24:14
dtype: object
0   0 days 00:22:33
1   0 days 00:13:12
2   0 days 00:24:14
dtype: timedelta64[ns]

In [136]:
pd.date_range('2021/01/01', freq='D', periods=10)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [139]:
pd.date_range("2021/01/01", "2021/01/10")

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [153]:
pd.date_range("2021/01/01 8:00","2021/01/01 10:00", freq='5T')

DatetimeIndex(['2021-01-01 08:00:00', '2021-01-01 08:05:00',
               '2021-01-01 08:10:00', '2021-01-01 08:15:00',
               '2021-01-01 08:20:00', '2021-01-01 08:25:00',
               '2021-01-01 08:30:00', '2021-01-01 08:35:00',
               '2021-01-01 08:40:00', '2021-01-01 08:45:00',
               '2021-01-01 08:50:00', '2021-01-01 08:55:00',
               '2021-01-01 09:00:00', '2021-01-01 09:05:00',
               '2021-01-01 09:10:00', '2021-01-01 09:15:00',
               '2021-01-01 09:20:00', '2021-01-01 09:25:00',
               '2021-01-01 09:30:00', '2021-01-01 09:35:00',
               '2021-01-01 09:40:00', '2021-01-01 09:45:00',
               '2021-01-01 09:50:00', '2021-01-01 09:55:00',
               '2021-01-01 10:00:00'],
              dtype='datetime64[ns]', freq='5T')

In [149]:
pd.date_range("2021/01/01 8:00","2021/01/01 10:00", periods=10)

DatetimeIndex(['2021-01-01 08:00:00', '2021-01-01 08:13:20',
               '2021-01-01 08:26:40', '2021-01-01 08:40:00',
               '2021-01-01 08:53:20', '2021-01-01 09:06:40',
               '2021-01-01 09:20:00', '2021-01-01 09:33:20',
               '2021-01-01 09:46:40', '2021-01-01 10:00:00'],
              dtype='datetime64[ns]', freq=None)

In [157]:
range = pd.date_range("2021/01/01 8:00","2021/01/01 10:00", periods=10)
tsi = pd.Series(np.random.randn(len(range)), index=range)
print(tsi)

2021-01-01 08:00:00    1.479959
2021-01-01 08:13:20    0.408933
2021-01-01 08:26:40    0.106165
2021-01-01 08:40:00   -1.198836
2021-01-01 08:53:20    0.378987
2021-01-01 09:06:40    0.275445
2021-01-01 09:20:00   -1.735805
2021-01-01 09:33:20    0.076814
2021-01-01 09:46:40   -0.830684
2021-01-01 10:00:00    0.804353
dtype: float64

In [156]:
ts = pd.Series(range)
print(ts)

0   2021-01-01 08:00:00
1   2021-01-01 08:13:20
2   2021-01-01 08:26:40
3   2021-01-01 08:40:00
4   2021-01-01 08:53:20
5   2021-01-01 09:06:40
6   2021-01-01 09:20:00
7   2021-01-01 09:33:20
8   2021-01-01 09:46:40
9   2021-01-01 10:00:00
dtype: datetime64[ns]

In [158]:
tsi["2021/01/01 8:00":"2021/01/01 8:30"]

2021-01-01 08:00:00    1.479959
2021-01-01 08:13:20    0.408933
2021-01-01 08:26:40    0.106165
dtype: float64

In [12]:
df = pd.read_csv('books.csv')
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [13]:
df.PublicationDate

0    25-Apr-2018
1    28-Aug-2016
2    17-Feb-2015
Name: PublicationDate, dtype: object

In [14]:
df['PublicationDate'] = pd.to_datetime(df.PublicationDate)
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral      2018-04-25
1  023125B         Controlled mind   Robert Greens      2016-08-28
2  005556E       Only love remains  Greta Blooming      2015-02-17

In [15]:
df.PublicationDate

0   2018-04-25
1   2016-08-28
2   2015-02-17
Name: PublicationDate, dtype: datetime64[ns]

In [16]:
df = pd.read_csv('books.csv', parse_dates = [3])
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral      2018-04-25
1  023125B         Controlled mind   Robert Greens      2016-08-28
2  005556E       Only love remains  Greta Blooming      2015-02-17

# Working with Text Data

In [34]:
df = pd.read_csv('books.csv')
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [35]:
print(df.ID)

0    001276A
1    023125B
2    005556E
Name: ID, dtype: object

In [36]:
print(df.Title)

0    The Rise of the Falcon
1           Controlled mind
2         Only love remains
Name: Title, dtype: object

In [37]:
print(df.Author)

0      John Admiral
1     Robert Greens
2    Greta Blooming
Name: Author, dtype: object

In [38]:
df = pd.read_csv('books.csv', dtype='string')
print(df)

        ID                   Title          Author PublicationDate
0  001276A  The Rise of the Falcon    John Admiral     25-Apr-2018
1  023125B         Controlled mind   Robert Greens     28-Aug-2016
2  005556E       Only love remains  Greta Blooming     17-Feb-2015

In [39]:
df.PublicationDate

0    25-Apr-2018
1    28-Aug-2016
2    17-Feb-2015
Name: PublicationDate, dtype: string

In [40]:
df.PublicationDate = pd.to_datetime(df.PublicationDate)
df.PublicationDate

0   2018-04-25
1   2016-08-28
2   2015-02-17
Name: PublicationDate, dtype: datetime64[ns]

In [41]:
df.Title = df.Title.astype('string')
df.Title

0    The Rise of the Falcon
1           Controlled mind
2         Only love remains
Name: Title, dtype: string

In [42]:
df.Title.str.upper()

0    THE RISE OF THE FALCON
1           CONTROLLED MIND
2         ONLY LOVE REMAINS
Name: Title, dtype: string

In [43]:
df.Title.str.lower()

0    the rise of the falcon
1           controlled mind
2         only love remains
Name: Title, dtype: string

In [45]:
df['Comment'] = [' Too long for a child   ',
                 'Interesting     book  ',
                 '   Very Impressive']
print(df)

        ID                   Title          Author PublicationDate  \
0  001276A  The Rise of the Falcon    John Admiral      2018-04-25
1  023125B         Controlled mind   Robert Greens      2016-08-28
2  005556E       Only love remains  Greta Blooming      2015-02-17

                    Comment
0   Too long for a child
1    Interesting     book
2           Very Impressive

In [46]:
df.Comment.str.len()

0    24
1    22
2    18
Name: Comment, dtype: int64

In [47]:
df.Comment = df.Comment.str.strip()
print(df.Comment)

0    Too long for a child
1    Interesting     book
2         Very Impressive
Name: Comment, dtype: object

In [48]:
print(df.Comment.str.len())

0    20
1    20
2    15
Name: Comment, dtype: int64

In [49]:
df.Comment.str.replace('  ','')

0    Too long for a child
1        Interesting book
2         Very Impressive
Name: Comment, dtype: object

In [52]:
df

,ID,Title,Author,PublicationDate,Comment
0,001276A,The Rise of the Falcon,John Admiral,2018-04-25,Too long for a child
1,023125B,Controlled mind,Robert Greens,2016-08-28,Interesting book
2,005556E,Only love remains,Greta Blooming,2015-02-17,Very Impressive

In [53]:
df.Author = df.Author.str.replace(' ',',')
print(df.Author)

0      John,Admiral
1     Robert,Greens
2    Greta,Blooming
Name: Author, dtype: string

In [54]:
df.Comment.str.replace('book','novel')

0     Too long for a child
1    Interesting     novel
2          Very Impressive
Name: Comment, dtype: object

In [55]:
df.Title.str.split()

0    [The, Rise, of, the, Falcon]
1              [Controlled, mind]
2           [Only, love, remains]
Name: Title, dtype: object

In [56]:
df.Author.str.split(',')

0      [John, Admiral]
1     [Robert, Greens]
2    [Greta, Blooming]
Name: Author, dtype: object

In [57]:
dfw = df.Author.str.split(',', expand=True)
print(dfw)

        0         1
0    John   Admiral
1  Robert    Greens
2   Greta  Blooming

In [58]:
type(dfw)

pandas.core.frame.DataFrame

In [59]:
df[['Author_name','Author_surname']] = df.Author.str.split(',', expand=True)
del df['Author']
df

,ID,Title,PublicationDate,Comment,Author_name,Author_surname
0,001276A,The Rise of the Falcon,2018-04-25,Too long for a child,John,Admiral
1,023125B,Controlled mind,2016-08-28,Interesting book,Robert,Greens
2,005556E,Only love remains,2015-02-17,Very Impressive,Greta,Blooming

In [60]:
df['Author'] = df['Author_name'] + ' ' + df['Author_surname']
df

,ID,Title,PublicationDate,Comment,Author_name,Author_surname,Author
0,001276A,The Rise of the Falcon,2018-04-25,Too long for a child,John,Admiral,John Admiral
1,023125B,Controlled mind,2016-08-28,Interesting book,Robert,Greens,Robert Greens
2,005556E,Only love remains,2015-02-17,Very Impressive,Greta,Blooming,Greta Blooming

In [234]:
df.Author_name.str.cat(df.Author_surname, sep=' ')

0      John Admiral
1     Robert Greens
2    Greta Blooming
Name: Author_name, dtype: string

In [61]:
del df['Author_surname']
del df['Author_name']
df

,ID,Title,PublicationDate,Comment,Author
0,001276A,The Rise of the Falcon,2018-04-25,Too long for a child,John Admiral
1,023125B,Controlled mind,2016-08-28,Interesting book,Robert Greens
2,005556E,Only love remains,2015-02-17,Very Impressive,Greta Blooming

In [62]:
df['ID1'] = df.ID.str.replace('([A-Z]+)', '', regex=True)
print(df.ID1)

0    001276
1    023125
2    005556
Name: ID1, dtype: string

In [63]:
df['ID2'] = df.ID.str.replace('([0-9]+)', '', regex=True)
print(df.ID2)

0    A
1    B
2    E
Name: ID2, dtype: string

In [64]:
del df['ID']
df

,Title,PublicationDate,Comment,Author,ID1,ID2
0,The Rise of the Falcon,2018-04-25,Too long for a child,John Admiral,001276,A
1,Controlled mind,2016-08-28,Interesting book,Robert Greens,023125,B
2,Only love remains,2015-02-17,Very Impressive,Greta Blooming,005556,E

In [66]:
df['ID'] = df.ID1.str.cat(df.ID2)
df.ID.str.extract('([0-9]+)')

        0
0  001276
1  023125
2  005556

In [67]:
df.ID.str.extract('([A-Z]+)')

   0
0  A
1  B
2  E

In [68]:
del df['ID']
df

,Title,PublicationDate,Comment,Author,ID1,ID2
0,The Rise of the Falcon,2018-04-25,Too long for a child,John Admiral,001276,A
1,Controlled mind,2016-08-28,Interesting book,Robert Greens,023125,B
2,Only love remains,2015-02-17,Very Impressive,Greta Blooming,005556,E

In [255]:
df.ID2.str.cat(['USA','ITA','FRA'],sep='-')

0    A-USA
1    B-ITA
2    E-FRA
Name: ID2, dtype: string

In [271]:
df['temp'] = 'USA'
df.ID2 = df.ID2.str.cat(df['temp'],sep='-')
del df['temp']
print(df.ID2)

0    A-USA
1    B-USA
2    E-USA
Name: ID2, dtype: string

In [272]:
df

,Title,PublicationDate,Comment,Author,ID1,ID2
0,The Rise of the Falcon,2018-04-25,Too long for a child,John Admiral,001276,A-USA
1,Controlled mind,2016-08-28,Interesting book,Robert Greens,023125,B-USA
2,Only love remains,2015-02-17,Very Impressive,Greta Blooming,005556,E-USA

In [273]:
df.ID1.str.isdigit()

0    True
1    True
2    True
Name: ID1, dtype: boolean

In [274]:
df.ID2.str.isalnum()

0    False
1    False
2    False
Name: ID2, dtype: boolean

In [275]:
df.Title.str.find('love')

0    -1
1    -1
2     5
Name: Title, dtype: Int64

In [276]:
df.Title.str.find('love') > -1

0    False
1    False
2     True
Name: Title, dtype: boolean